package tgbot

const (
	welcomeMessage = "Добро пожаловать!👋\n\nCкорее всего вам поручили задание создавать видео для нашего канала!🎥\n\n Перед тем как ты начнешь пользоваться ботом ознакомся с правилами ниже 👇👇.\n\n Если же ты здесь не в первый раз, тогда чего ты тянешь, скорее жми на кнопки🧩🧩\n\n Выберите действие:"

	tutorialMessage = "🎵 Руководство по использованию HSAIBOT 🎵\n\nСоздание музыкального клипа — это просто! Всего два этапа:\n\n1. Генерация песни\n\n2. Генерация видео\n\n________________________________________________________________________\n\n1) Генерация песни:\n\n✨ За создание музыки отвечает нейронная сеть SunoAI.  \nЭто удивительный инструмент для создания музыки по текстовому запросу. Вы можете выбрать любой жанр, описать голос исполнителя или создать инструментальную композицию.\n\nЧто нужно сделать:\n\n• 📝 Ввести промт: опишите тематику песни\n\n• 🎶 Выбрать жанр песни\n\n⏱ Время генерации: около 3 минут.\n\nВы также можете создать песню без слов, состоящую исключительно на основе эффектов и звучания различных инструментов 🎻\n\nЕсли результат не устраивает, вы можете попробовать снова! \n\n💡 Доступно до 5 попыток в день.\n\n________________________________________________________________________\n\n2) Генерация видео:\n\n🎥 За создание видео отвечает нейронная сеть Kandinsky 3.1.  \n\nЭто российская нейронная сеть, специализирующаяся на генерации картинок и видео по текстовому запросу.\n\nЗапросы для Kandinsky 3.1 создаются на основе текста ранее сгенерированной песни.\n\n —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  \n\nНаслаждайтесь процессом создания вашего уникального музыкального клипа! 🌟\n\n —   —  —  —  —  —  — —  —  —  —  —  —  —  —  —  —  —  —  —  —  \n\nP.s Общая генерация видео занимает около 30 минут, поэтому запаситесь терпением 🙃\n\n________________________________________________________________________ \n\nОшибки ⚠️\n\n —   —  —  —  —  —  — —  —  —  —  —  —  —  —  —  —  —  —  —  —  \n\n1)  Музыка\n\n При возникновении ошибки во время генерации песни убедитесь в работоспособности аккаунта suno ai и в том, что на нем есть монеты для генерации.\n\nЕсли же проблем с аккаунтом нет, то обратитесь к администратору\n\n —   —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  —  \n\n2)  Видео\n\nОшибка может возникнуть если:\n\n1) Генерация одной из частей видео продлилась дольше 17 минут\n2)  Неполадки с интернетом\n\nПри возникновении ошибок на этом этапе попробуйте сгенерировать видео заново, иначе обратитесь к администратору"

	promptMessage = "Сейчас тебе нужно написать запрос для нейросети, которая создаст видео для нашего канала✨🎞️\n\nВведите запрос:"

	songStyleMessage = "Выберите стиль песни для нашего будущего клипа или введите свой:"

	instrumentalMessage = "Если вы хотите получить исключительно инструментальную песню, выберите 'Instrumental'.\n\nИначе 'Not Instrumental.'"

	waitSongMessage = "Ваш запрос был утвержден!\n Примерное время ожидания 5 минут..."

	chooseSongMessage = "Выберете номер понравившейся песни: "

	videoStyleMessage = "Выберите стиль видео: "

	aproveVideo = "Устраивает ли вас видео?"

	unknownMessage = "Пожалуйста, нажмите на кнопку🤗"

	unknownComandMessage = "Неизвестная команда. Используйте /start для начала."

	errorGenerateMessage = "Что-то пошло не так...\nПопробуйте загрузит видео заново"

	endMessage = "До скорых встреч:)"
)
